Math-Notes/InfiniteSeries.tex
% Created 2015-03-30 Mon 12:09
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Chuan Liu}
\date{\today}
\title{InfiniteSeries}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Trigometric Series}
\label{sec-1}
\subsection{partial sum of $\sin{k}$ is bounded, while for $\sin{k^2}$ it is not}
\label{sec-1-1}
 For the first series, note that
\[
2\sin{k}\sin{0.5}=\cos(k - 0.5) \minus \cos(k + 0.5).
\].
But this trick does't work since $k^2$ is  not a arithmetic progression.
\subsubsection{Tao's answer on the second part}
\label{sec-1-1-1}
No. If one selects a number k at random from 1 to a large number n,
then for any fixed h, the random variables sin((k+1)2),…,sin((k+h)2)
asymptotically have mean zero, variance 1/2, and covariances 0, from
standard Weyl sum estimates. Hence the variance of ∑hi=1sin((k+i)2) is
asymptotically h/2, which goes to infinity as h→∞. On the other hand,
if the partial sums of sin(k2) were bounded, then this variance would
have to be bounded also. [Exercise: what part of the above argument
breaks down when working with sin(k) instead of sin(k2)?]

It may be possible to push this argument to show that the partial sums
have to fluctuate by ≫n√ infinitely often, but I haven't checked this
(certainly a lower bound of ≫nε for some small ε>0 should be possible
from the above argument, perhaps contingent on some conjecture about
the irrationality measure of π). Heuristically, the law of the
iterated logarithm suggests that the sum can occasionally get as large
as ≫nloglogn−−−−−−−−√, but no larger.
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}